# ShowGraphicalWarningPipeDisconnects Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ShowGraphicalWarningPipeDisconnects Property
Application Class See Also
---
Whether or not to show the graphical warnings for Pipe disconnects.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ShowGraphicalWarningPipeDisconnects { get; set; }
```

Visual Basic
---
```text
Public Property ShowGraphicalWarningPipeDisconnects As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGraphicalWarningPipeDisconnects {
	bool get ();
	void set (bool value);
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace